[Killed] BlockStatement
src/model/Conta.ts:8:54
     private _numeroConta: NumeroConta
     private _saldo: number;
 
-    public constructor(numero: string, saldo: number){
-      this._numeroConta = new NumeroConta(numero)
-      this._saldo = saldo;
-    }
+    public constructor(numero: string, saldo: number){}
 
     public sacar(valor: number): void {
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'numero')

[Killed] BlockStatement
src/model/Conta.ts:13:39
       this._saldo = saldo;
     }
 
-    public sacar(valor: number): void {
-      this.validarValor(valor);
-    
-      if((this._saldo - valor) < 0)
-        throw new NegocioErro("saldo indisponível para operação");
-
-      this._saldo -= valor;
-    }
+    public sacar(valor: number): void {}
 
     public get saldo() : number {
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4900
Received: 5000

[Killed] EqualityOperator
src/model/Conta.ts:16:10
     public sacar(valor: number): void {
       this.validarValor(valor);
     
-      if((this._saldo - valor) < 0)
+      if(this._saldo - valor >= 0)
         throw new NegocioErro("saldo indisponível para operação");
 
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: saldo indisponível para operação

[Killed] ArithmeticOperator
src/model/Conta.ts:16:11
     public sacar(valor: number): void {
       this.validarValor(valor);
     
-      if((this._saldo - valor) < 0)
+      if((this._saldo + valor) < 0)
         throw new NegocioErro("saldo indisponível para operação");
 
killedBy: Conta sacar valor acima do saldo
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "saldo indisponível para operação"

Received function did not throw

[Killed] BlockStatement
src/model/Conta.ts:26:43
       return this._saldo;
     }
 
-    public depositar(valor: number): void {
-      this.validarValor(valor);
-      this._saldo += valor;
-    }
+    public depositar(valor: number): void {}
 
     private validarValor(valor: number): void{
killedBy: Conta depositar com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5200
Received: 5000

[Killed] AssignmentOperator
src/model/Conta.ts:28:7
 
     public depositar(valor: number): void {
       this.validarValor(valor);
-      this._saldo += valor;
+      this._saldo -= valor;
     }
 
killedBy: Conta depositar com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5200
Received: 4800

[Killed] BlockStatement
src/model/Conta.ts:31:46
       this._saldo += valor;
     }
 
-    private validarValor(valor: number): void{
-      if(valor <= 0){
-          throw new NegocioErro("valor não pode ser igual ou menor que zero");
-        }
-    }
+    private validarValor(valor: number): void{}
 
     public get numero(): string {
killedBy: Conta sacar com valor zerado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "valor não pode ser igual ou menor que zero"

Received function did not throw

[Killed] ConditionalExpression
src/model/Conta.ts:32:10
     }
 
     private validarValor(valor: number): void{
-      if(valor <= 0){
+      if(false){
           throw new NegocioErro("valor não pode ser igual ou menor que zero");
         }
killedBy: Conta sacar com valor zerado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "valor não pode ser igual ou menor que zero"

Received function did not throw

[Killed] EqualityOperator
src/model/Conta.ts:32:10
     }
 
     private validarValor(valor: number): void{
-      if(valor <= 0){
+      if(valor > 0){
           throw new NegocioErro("valor não pode ser igual ou menor que zero");
         }
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: valor não pode ser igual ou menor que zero

[Killed] StringLiteral
src/model/Conta.ts:33:33
 
     private validarValor(valor: number): void{
       if(valor <= 0){
-          throw new NegocioErro("valor não pode ser igual ou menor que zero");
+          throw new NegocioErro("");
         }
     }
killedBy: Conta sacar com valor zerado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "valor não pode ser igual ou menor que zero"
Received message:   ""

       97 |         } else {
       98 |           stryCov_9fa48("29");
    >  99 |           throw new NegocioErro(stryMutAct_9fa48("30") ? "" : (stryCov_9fa48("30"), "valor não pode ser igual ou menor que zero"));
