[Killed] BlockStatement
src/model/NumeroConta.ts:21:33
         const regExp: RegExp = /^\d{6}$/;
         return regExp.test(numero);
     }
-    public get numero(): string {
-        return this._numero;
-    }
+    public get numero(): string {}
 }
killedBy: Transferência Serviço transferir com sucesso
statusReason: Error: conta de origem não encontrada
